Revit 2024 API
SketchedStairsCurveData Members
The SketchedStairsCurveData type exposes the following members.
Constructors
Name | Description
SketchedStairsCurveData
 Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Methods
Name | Description
Dispose
Releases all resources used by the SketchedStairsCurveData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCurve
 Get a copy of the curve that is formed along this boundary.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace